run/pitzDailyPANS/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             backward;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default             none;
    div(phi,U)          Gauss LUST grad(U);
    turbulence          bounded Gauss limitedLinear 1;
    div(phi,k)          $turbulence;
    div(phi,kU)         $turbulence;
    div(phi,epsilon)    $turbulence;
    div(phi,epsilonU)   $turbulence;
    div(phi,omega)      $turbulence;
    div(phi,omegaU)     $turbulence;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(nonlinearStress) Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
